function W = W(n, R, h, dis)
%¬ычисление функции W(n, h, R) ослаблени€ дл€ данного номера частоты n 
%(1 - 10.2к√ц; 2 - 12.1к√ц; 13.6к√ц), эффективной высоты h и коэффициента
%поглощени€ R, dis - дисперси€ R
d = 885;                %длина радиотрассы, км
a = 6370;               %радиус земли, км
theta = d / a;          %отношение длины радиотрассы к радиусу земли, км
em = 10;                %относительна€ диэлектрическа€ проницаемость
S = 10^(-3);            %проводимость земли, —им/м (S/m)
c0 = 2.997992 * 10^5;   %скорость света, км/с
e0 = 8.85 * 10^(-12);   %электрическа€ посто€нна€, ‘/м

%нулевой(дифракционный) ионосферный луч, с хорошей точностью равен
% 0.5*exp(1i)
W0 = 0.65 * exp(1i);

                        %можно учесть зависимость от частоты (дисперсию)
switch n                %модул€ коэффициента отражени€ от ионосферы,
    case 1              %если ввести множитель Bmod
        Bmod = 1-dis;   %
    case 2              %
        Bmod = 1;       %
    case 3              %
        Bmod = 1+dis*(1.5/1.9);   %
end                     %
R1 = Bmod * R;          %

%¬озвращает круговую частоту согласно еЄ номеру 
%(1 - 10.2к√ц, 2 - 12.1к√ц и 3 - 13.6к√ц)
switch n
    case 1
        f = 10.2 * 10^(3);
    case 2
        f = 12.1 * 10^(3);
    case 3
        f = 13.6 * 10^(3);
end
omega = 2 * pi * f;

%расчет геометрических путей ионосферных лучей
D1 = 2 * a * sin(theta / (2 * 1));  
D2 = 2 * a * sin(theta / (2 * 2));

A1 = a * cos(theta / (2 * 1));    
A2 = a * cos(theta / (2 * 2)); 

H1 = a - A1;       
H2 = a - A2;

%угол падени€ первого и второго ионосферных лучей
psi1 = acos((h + H1) / sqrt((h + H1)^2 + (D1 / 2)^2));
psi2 = acos((h + H2) / sqrt((h + H2)^2 + (D2 / 2)^2));

%углы выхода первого и втоорого ионосферных лучей
I1 = psi1 + theta / (2 * 1);
I2 = psi2 + theta / (2 * 2);

alpha1 = sqrt((2 * sin(theta/2)) / sin(theta)) * sqrt((cos(psi1) / cos(I1)));
alpha2 = sqrt((4 * sin(theta/4)) / sin(theta)) * sqrt((cos(psi2) / cos(I2)));

%»мпеданс dg и модуль коэффициента отражени€ Rg от земли
dg = 1 / sqrt(em + 1i * (S / (omega * e0)));
Rg1 = (cos(I1) - dg) / (cos(I1) + dg);
Rg2 = (cos(I2) - dg) / (cos(I2) + dg); 

%геометрические пути первого и второго ионосферных лучей
L1 = sqrt((D1/2)^2 + (h + H1)^2);
L2 = sqrt((D2/2)^2 + (h + H2)^2);

%разность оптических путей t-го луча и геодезической дугой d между
%источником и приемником
lambda = 2 * pi * c0 / omega;
k1 = (2 * 1 * L1 - d) / lambda;
k2 = (2 * 2 * L2 - d) / lambda;

Delta = 0.35;
switch n
    case 1
        Barg = -1;
    case 2
        Barg = 0;
    case 3
        Barg = 1;
end
argR1 = pi + Barg * Delta * (pi/2 - psi1) / (pi/2 - 1);
argR2 = pi + Barg * Delta * (pi/2 - psi2) / (pi/2 - 1);

W1 = 0.5 * alpha1 * (1 + Rg1)^2 * sin(I1)^2 * R1 * ...
    exp(1i * (2 * pi * k1 + argR1));

%модуль коэффициента отражени€ второго ионосферного луча
R112 = R1 + (1 - R1) * (psi2 - psi1) / (pi/2 - psi1);
if R112 > 0 
    R2 = R112;
else
    R2 = 0;
end

W2 = 0.5 * alpha2 * (1 + Rg2)^2 * Rg2 * sin(I2)^2 ...
    * R2^2 * exp(1i * (2 * pi * k2 + 2 * argR2));

W = W0 + W1 + W2;
end                                                                                               
